load-test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - pause: 5
      name: "Startup delay"

    - duration: 60
      arrivalRate: 10
      name: "Warm up"

    - duration: 120
      arrivalRate: 50
      name: "Load test"

scenarios:
  - name: "Public health checks"
    flow:
      - get:
          url: "/health"

      - get:
          url: "/ready"